{
  "id": "blog_1748946006677_ojion0t2e",
  "title": "Supreme Court upholds Delhi Assembly Committee’s summon to Facebook India head Ajit Mohan",
  "author": "By Yatish Kumar Goel, Advocate",
  "summary": "The Delhi Court has issued guidelines on declaring an absconding accused as a proclaimed offender.",
  "content": "The Delhi Court has issued guidelines on declaring an absconding accused as a proclaimed offender. It observed that declaring a person as a proclaimed offender affects his life and liberty under Article 21 of the Constitution and a due process of law must be followed in this regard.\n\nThe Delhi High Court recently laid down comprehensive guidelines on how to go about declaring persons absconding from the law as “proclaimed offenders” under Section 82 of the Code of Criminal Procedure (CrPC). A single bench of Justice JR Midha laid down the guidelines to be followed by the courts before declaring a person as a “proclaimed offender” and the follow-up action needed to be taken by the law enforcement agencies in this regard.\n\nThe Court also issued a detailed mechanism for the early apprehension of “proclaimed offenders”, including setting up of a “Digital Surveillance System” by the Delhi Police, with access to specific government departments for tracking such “proclaimed offenders”.\n\nThe Court was prompted to issue the guidelines while dealing with two petitions wherein it was alleged that the petitioners were declared “proclaimed offenders” without following due procedure. Upon finding that they were not served proper notice, the Court allowed their pleas and quashed the orders declaring them as “proclaimed offenders”.\n\nThe Court was of the view that declaring a person as a “proclaimed offender” led to a serious offence under Section 174A IPC, which was punishable for a period of upto three or seven years. It affected the life and liberty of a person under Article 21 of the Constitution of India and it was necessary to ensure that the process under Sections 82 and 83 CrPC was not issued in a routine manner and the due process of law was followed. The second important aspect was that once a person had been declared as “proclaimed offender”, it was the duty of the State to make all reasonable efforts to arrest him and attach his properties as well as launch prosecution under Section 174A IPC.\n\nThe 185-page judgement also directed the digital surveillance team of the Delhi Police and the Central Bureau of Investigation to keep a tab on social media websites, namely, Facebook and Twitter to track those declared proclaimed offenders.\n",
  "image": "/uploads/1748945933092_dcqrupibq.png",
  "createdAt": "2025-06-03T10:20:06.677Z",
  "updatedAt": "2025-06-03T10:20:06.677Z"
}